{"Id":255,"Title":"科比退役了我的青春","Slug":"2016-04-14-1","Text":"    我的一个梦想就是有一天去斯台普斯球馆，看一场科比的湖人比赛，无论对手是谁不重要，而今天，他小子居然退役了，这真是一个遗憾。\n\n    科比退役了，今天最后一场球，可今天的这篇文字，可能煽情的依然是我的青春而不是唠嗑，这多少有点煞风景,可在这个日子里，无数人用这个身影来缅怀自己逐渐老去的一代人的青春，也就算是对唠嗑的一种致敬吧。\n\n    我是一个狂热的篮球迷，从青葱，到成年，一直都是。\n\n    我最喜欢的篮球员动员是科比，肯定的啊，那么杰出，纯粹，优美的篮球员动员，谁会不喜欢呢！\n\n    科比退役了，今天是他最后的一场球赛，说实话，我在起初，没感觉到什么，照常上着班，偶尔拿出手机，来回切换着用文字直播看着湖人还有勇士的比赛情况，开始也只是想着，“哦，真应该请个假去看直播”，直到，通过文字直播，科比的执拗的热情刺穿我本已麻木的热情。\n\n    张公子说：“真正的科比也许早离开了，今天只是为了告别而归来。”，作为一个老湖人球迷，最近三年，我已经不怎么关注湖人的比赛，确实是那样，科比，在我心中，已经退役很久了，远在那次跟腱的断裂，他的时代就已经结束了，偶尔在某些科黑无脑的谩骂评论中，愤愤然的想着怎么能对一个如此坚强的斗士喷这些言语。直到：\n\n\u003e 第四节中段 追身三分得手，第40分。全场开始喊科比。大概是这歌声，振奋了他。\n\n\u003e  从这时候开始，进入科比节奏。\n\n\u003e 所谓科比节奏，即是说，进入NBA历史上几乎绝无仅有的，“我知道这不是投篮好机会，但我就是手起刀落投得中”，tough shot maker。\n\n\u003e  弧顶急停三分，39投16中43分。\n\n\u003e  右翼急停出手敲篮筐后沿后，再补上两次投篮。得到第45分\n\n\u003e 之后，进入黑曼巴状态。\n\n\u003e  后面的疯狂，真正的球迷，都会被激动的热泪盈眶\n\n    真的，你无法描述那种震撼，就如你的青春一下子回来了，就如，你又找到了那群一起打球一起打架的家伙，找到了那个给你初恋悸动又苦涩的姑娘，回到了那个怀揣理想未来无限的时代...，虽然，我这个时候也只能在还算隐蔽的工位上假装有一粒来自遥远的沙子钻进了了我的眼睛。\n\n**青春不死，只是退役，开启另一段旅程！**\n\n    98年，我上初中，开始的疯狂的中学生活，那时候我瘦小，阴郁，傲慢，暴力。也许是出色的学习成绩给了我最大的自信，那个时候感觉自己无所不能，感觉自己将来是个上天入地的人物。我也是从那个时候，知道了了NBA和科比，虽然那还是乔丹的时代。可我那个时候身材矮小，再加上本身运动细胞就不是很发达，所以根本和篮球不沾边，主要的运动就是跑步，什么都不想，看着前方十米的地面，就这样一直跑下去，跟随头上4/6分头长发的飘动节奏。直到初四的时候疯狂长个子到了170，才能把篮球扔到篮筐的高度，那是2002年，OK三连冠，如日中天，科比的海报也偶尔在那个贫穷的乡下中学附近的小卖部买到，我也只是知道，那是一个长得秀气的，眼神犀利的黑人小子。\n\n    03年上高中，去了县城，可以看得见CCTV5的体育频道了，各种海报更是满天飞，也许是先入为主的原因，对科比比较有好感，那个时候身体虚弱，经常生病，去学校的周边打点滴，看的大部分球赛，居然是在病床上挂着点滴看着输液室的电视，也是那几年，才真正的看了一些NBA的比赛，真正建立起来对科比的喜爱。\n\n    高中，我依然是老师的宠儿，基本垄断大部分考试班级的第一，还经常地请假，球场飞奔，擅长长跑，基本从不做厚厚的习题集。那个时候感觉自己的存在就是一种碾压，甚至会感到对那些好好学习还被碾压的同学的一种不尊重，想想自己如果努力一点，还不是会上天啊。那时候喜欢科比，也是因为喜欢科比的那种碾压一切的气质，那种清楚地隔着屏幕都能让所有的对手感受到，“今年我们搞不定他”。就是这种感觉。\n\n    所以我看着科比的球赛，碾压着我的同学，也碾压者我的青春，去夺得校运会的5000米冠军，去拿奥赛物理的全国二等奖，去拿校办数理化的第一名，甚至去拿是个朗诵大赛的全校的第一名，用自己写的诗歌，在一张别人都认不清的草稿纸上半成品....，班主任老魏跟对我期望深重的老爸说：”即使考不好，也能走南开那个级别的吧“\n\n    直到自负和病魔摧毁我....\n\n    我抱着欲裂的脑袋，疼的睡不着觉，疼的流泪，然而继续逃课，打球，看球，输液，奔溃...  无休无止，恶性循环，那是科比最孤单的也是最执拗的05，06年...\n\n    我进了一所二流大学，离开了家乡，离开了最让我风光也让我终点落魄的中学时代\n\n    在大学，我很少落下科比的湖人比赛，跟周围的哥们一起打球，跟詹密，真理密，加内特蜜，绿衫军密争论，然后继续着我的沉沦，基本不去上课，大学四年班级的同学认不全...，看着科比迎来他的家嫂和第二段辉煌，我却挥霍着自己的日子，深陷一系列的失落无法自拔，还在经常地梦见回去复读，但是却一道题都不会做了，一身冷汗的惊醒...\n\n    时光总是匆匆，10年毕业，参加工作，然后紧接着家庭的变故，父亲的离世，我的噩梦变成了两个。可生活还在继续，我们也必须承担起自己造就的历史，去承担一个男人该承担的责任。\n\n    也许，当有了一分责任，你才会真正的成长为一个男人。\n\n    就如科比抗争的这三年，再难，也要当一个硬汉\n\n    其实许多人都是如此。少年时，追着每场球看，看到了最巅峰的时刻，痴狂地爱上；之后，便是时光流逝，物是人非。有人要换学校，有人要毕业工作，有人有了家庭。这个时代资讯发达，许多人已经来不及看完一场球。偶尔和原来的球迷同学一起聊一下，大概的感觉也是如此：\n\n\u003e“哦？科比还在打球。哦？科比又得了多少分啦？”\n\n    不只是对科比。许多人都是如此。年纪长了，时间少了，许多爱，分不过来了。\n\n    今天，那个执拗的男人正式的完成了最后的一场NBA表演，不再是怒目抿嘴，叼着球衣，而是一种严肃，疲劳却依旧坚定，他开始了另一段旅程，我也不再青葱，每日兢兢业业的上班，维护者一家的老小。\n\n    喜欢他，也许是喜欢他的执拗坚韧纯粹，把他定位自己的模版，而回顾自己的过往，也许更像伤仲永，说得好一点，也就是麦迪，挥霍了自己的天赋和青春，可即使是这样，看见那个坚韧的男人，还是会想：**他退役的只是我的青春，而不是我的人生，那个不甘一生平凡的我的人生。**\n\n    附科比素描\n\n![KB](/static/upload/2016041417561910.jpg)\n\n![KB](/static/upload/201604141756223.jpg)\n\n![KB](/static/upload/201604141756267.jpg)\n\n![KB](/static/upload/201604141756334.jpg)\n\n![KB](/static/upload/201604141756367.jpg)\n\n![KB](/static/upload/2016041417563910.jpg)\n\n![KB](/static/upload/201604141756434.jpg)\n\n![KB](/static/upload/201604141756467.jpg)\n\n![KB](/static/upload/201604141756567.jpg)\n\n![KB](/static/upload/201604141756589.jpg)\n\n![KB](/static/upload/201604141757012.jpg)\n\n![KB](/static/upload/201604141757045.jpg)\n\n![KB](/static/upload/201604141757101.jpg)\n\n![KB](/static/upload/2016041417571910.jpg)\n\n![KB](/static/upload/201604141757223.jpg)\n\n![KB](/static/upload/201604141757256.jpg)\n\n![KB](/static/upload/2016041417572910.jpg)\n\n![KB](/static/upload/201604141757323.jpg)\n\n![KB](/static/upload/201604141757356.jpg)\n\n![KB](/static/upload/201604141757389.jpg)\n\n![KB](/static/upload/201604141757412.jpg)\n\n\n","Tags":["NBA"],"CreateTime":1460628012,"EditTime":1469070416,"UpdateTime":1460628012,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[],"Hits":210}