{"Id":225,"Title":"2015总决赛第四场：你们城里人真会玩","Slug":"2015-05-15-4","Text":"JR史密斯今天到球场时，踩着一双疑似是遥控的灯光旱冰鞋。毕竟是打纽约过来的浪子，城里人真会玩。\n勇士开场阵容：191公分的库里，201公分的汤普森，198公分的伊戈达拉，203公分的巴恩斯，201公分的格林。考虑到格林入行时填的第一位置是小前锋，库里大学里还是得分后卫，这简直就是一个摇摆人首发。太好了，城里人真会玩。\n\n\u003cHR\u003e\n\n\n这是勇士实际上的生死战，众所周知。科尔摆这阵势，两个故事。\n\n+ 他是凤凰城太阳的前老总。这个阵势，十年前的凤凰城球迷定然看得泪流满面。\n+ 本季勇士常规赛有过八套首发，合计二十套不同的五人阵容排布，但这个五人阵，从来没摆过。\n\n老尼尔森、迈克-丹东尼、大范甘迪、莱利等诸位疯狂试验家，到此也不免抱拳拱手：行，你敢赌，行。\n\n所以开场，勇士被骑士揍个7比0也很自然了。勒布朗一定想：“当我是白痴啊！”专门传球找着莫兹科夫，揍。\n\n但一个暂停后，勇士缓过来了。\n\n库里单挑，一个三分球。伊戈达拉一个中投。库里+格林挡拆后，格林上篮。伊戈达拉反击扣篮。库里+格林挡拆后，格林助攻巴恩斯三分球。\n\n勇士的前12分，是这样得的。这也就是他们全场套路的缩影了。\n\n上一场，勇士的套路：\n\u003e 库里每次都能吸引夹击？好，就给其他放空的队友吧。\n\n这其实，可以理解为库里在呐喊：“我吸引他们注意力，你们负责灭门！——勒布朗被夹击队友能投进球，你们也拜托拜托吧！”\n\n而他们的问题：\n\u003e 可以说，伊戈达拉和利文斯顿是全队替补最聪明的二位，但要命的是：他们二位，看得见，想得到，但手上不够稳。利文斯顿是不会三分球的，伊戈达拉是个三分半吊子。\n\n实际上，伊戈达拉自己还做了许多事：他持球时，勒布朗在防守，等于将骑士的协防抽干了筋血，于是伊戈达拉自己投三分、找空切队友。但他三分不够稳。\n\n勇士真正的问题是谁呢？格林和巴恩斯。博古特被放空却不得分，那是能力所限。但格林得到无数空位却无法惩罚对手，巴恩斯今天8投0中，从中投到定点三分一片稀烂。\n\n今天，勇士做到了。\n\n伊戈达拉首发，骑士无人可以防他，只好用莫兹科夫对位，类似于西部半决赛博古特对位托尼-阿伦——结果，伊戈达拉全场都在投莫兹科夫，“你有本事出来呀！”\n\n![4-0](/static/upload/201506151700256.jpg)\n\n以及单枪匹马推这样的快攻：\n\n![4-1](/static/upload/201506151700256.jpg)\n\n格林的进攻侵略性十足，实际上，勇士上半场基本放弃了“库里找掩护后迂回”，而是干脆的“库里+格林挡拆，格林立刻分球或自己投”。这就变成去年总决赛的套路：马刺趁热无限夹击，找空位投篮。\n\n![4-2](/static/upload/201506151700367.jpg)\n\n格林投三分、格林助攻巴恩斯、格林自己造罚球。伊戈达拉欺负莫兹科夫防不出来。勇士的进攻开了。\n\n![4-3](/static/upload/201506151700367.jpg)\n\n![4-4](/static/upload/201506151700378.jpg)\n\n第一节剩4分钟时的暂停里，科尔的叫嚷是勇士本场的核心：\n**“骑士会累的！”**\n\n的确如此。\n\n骑士的进攻，也只有那么多戏法可以变。勒布朗单挑，吸引夹击，分球，队友三分球是主轴。今天稍微不一样：勇士放小球阵容，按规矩是得用前场篮板屠宰他们的，如此好逼勇士变阵。莫兹科夫、特里斯坦-汤普森蹲禁区里，欢天喜地：二位今天各6个前场篮板，合计26投15中，莫兹科夫还带12罚10中，真仿佛鲨鱼附体。问题在于，勇士变了一变：\n\u003e 伊戈达拉主防勒布朗，是其一变——前三场，就数他防勒布朗效果好——再一变，是勇士的夹击时机和防守轮转。小球阵容的好处就在这里：内线虚，需要补位，但大家脚下快，轮转也到位。勇士今天对勒布朗的夹击很聪明，要么是提前夹击，逼他将球送走；要么是等他已经无法传球时夹击。像这个就是及时夹击后，利文斯顿迅速返位，让JR史密斯无法轻松空位投篮。\n\n![4-5](/static/upload/201506151700423.jpg)\n\n![4-6](/static/upload/201506151700489.jpg)\n\n所以，今天勒布朗招牌的“突破吸引四双眼睛长传弱侧三分”，没怎么开。第三节初趁着克雷-汤普森走神甩了一下，但就这样了。\n\n当勒布朗无法突破分球，而只是不断给俩内线塞球时，他的破坏力会打些折。总决赛前三场，他连得分带助攻，骑士291分里他包了200分（借个冰球概念）；但本场，夹击到位、内线有更好的投篮选择，他的效率下去了。\n\n以及：他毕竟是人类，也会累的。第二节勒布朗脑袋蹭伤后，范甘迪在解说间阴飕飕地说：\n\n**“勒布朗本来今天开场就动力不足（low energy）。”**\n\n虽然是新阵出场，但科尔的时间凑得很好。对骑士的常规阵容，勇士上小球；一等莫兹科夫下去，立刻上大卫-李，去禁区里倒腾。\n\n但第三节，勇士还是乱了。骑士的防守出招：\n+ 全场领防，刹勇士的速度。\n+ 阻绝球，不让勇士舒畅传递，逼勇士单打。\n\n第三节前半段，勇士是靠伊戈达拉的三分球、巴恩斯的单打、库里的个人才华撑下来的。之后骑士赌博式破坏传球路线加上勒布朗的突击，追到了62比65。\n\n这是本场真正的生死之际，但是：\n\u003e 巴恩斯和伊戈达拉控制住了局面，确切说，是伊戈达拉个人的活跃。\n\u003e 防守端，伊戈达拉封锁了勒布朗；进攻端，三分、个人强推罚球、中投：莫兹科夫你有本事出来呀！\n\n![4-7](/static/upload/201506151701045.jpg)\n\n勇士的最后一波是这样的：\n\n\u003e 第三节末和第四节初，库里连续两次借对球掩护逼出换防后三分球，再一个“库里——格林——利文斯顿——伊戈达拉”式的连线，勇士领先到88比74。而那时，骑士只剩下莫兹科夫单挑了。比赛结束。\n\n![4-8](/static/upload/201506151700589.jpg)\n\n![](/static/upload/201506151701056.jpg)\n\n上场比赛后说的：\n\u003e 所以勇士需要什么呢？根据下半场的经验，他们得多给库里设立持球掩护，多用用大卫-李（或者斯贝茨），给博古特设计点可以得分的套路，当然，最好的法子还是敲敲巴恩斯和格林的警钟——“该你们俩独的时候，做点狠事儿啊！出来混要讲信用，给你们机会就要杀他们全家啊！”\n\n勇士确实利用了库里的牵制。李也上了。\n\n巴恩斯和格林确实争气了——当然，他俩是要进了快节奏才能热血起来的。今天的节奏，很合他们的脾胃，尤其是格林：果敢了。\n\n![4-10](/static/upload/201506151701067.jpg)\n\n但勇士最大的功臣，是两个人。\n\n本场MVP，或者说，勇士总决赛四场以来的MVP，是伊戈达拉。\n\n单防勒布朗；射中关键三分；个人连续快攻；单挑莫兹科夫——在这一切背后，是他的首发带起了勇士的节奏。\n\n过去三场，骑士的防守胜利，在于他们放任博古特、格林和巴恩斯，死守库里，“你们是好汉的，剁我一刀！”\n\n而今天伊戈达拉出阵，勇士等于放弃了后场篮板——全场骑士16个前场篮板——但拼命跟骑士搏跳投、搏速度，“我先拉自己一刀，您随意！”\n\n以及，肖恩-利文斯顿。\n\n今天利文斯顿抓了6个防守篮板，大部分是“格林和汤普森抢成一团，利文斯顿过去拣了，就地推快攻”。他给伊戈达拉送出击地传球，助攻了快攻扣篮；吸引夹击后找到大卫-李，诸如此类。当然，他还担当了接应点，让格林的传球有终结点。伊戈达拉和利文斯顿交替防守勒布朗推快攻，在弱侧轮转得严丝合缝，没让骑士的射手们快活，捎带回收了无数后场篮板。最重要的是，他俩加上格林的果决，让勇士找回了先前纵横天下的转移球。\n\n当然，话题还是得回到勒布朗与库里。\n\n勒布朗打得没什么可说的。依然是准三双数据，命中率也并不比前三场差太多，依然指挥若定，在进攻端的选择正确。唯一的问题是罚球。勇士成功的地方，在于让勒布朗犹豫了。伊戈达拉的防守，弱侧时不时的夹击，放小球阵容后的站位，勒布朗没法再简洁地“突击吸引夹击分球或者自己来”了。以及，他的体力，确实现出问题来了——没法子，他担负着NBA史上空前沉重的进攻任务呢。\n\n而库里，则是不犹豫。本场他的思路很清晰：找掩护，吸引夹击，立刻给格林传空位；要么找掩护，逼出换防来直接投。减少了运球找队友，出球更快，进攻也更迅疾。第三和第四节那两个神来之笔的三分球，对气势大有帮助。此外，小个阵容也便于他发动“被夹击后给格林，连续传球找空位”。比如，下面这个库里——格林——利文斯顿——伊戈达拉四重奏。\n\n![](/static/upload/201506151701145.jpg)\n\n![](/static/upload/201506151701167.jpg)\n\n![](/static/upload/201506151701212.jpg)\n\n说来说去，无非那句：超级巨星们是不能犹豫的。在这个绝少一对一防守、大家拼换防和轮转速率的时代，谁快一步，谁敢赌，谁就先一招。布拉特教练之前赌了勇士诸将投不进三分球，科尔今天就赌了小球阵容。\n\n\u003e “你有本事砍我一刀！”\n\u003e “我自己拉一刀了，你敢跟着来吗？！”\n\n作为两个第一次打总决赛的教练，他俩到现在为止的对局，都算极大胆了。\n\n**你们城里人真会玩。**\n\n哦对了。\n\n2011年总决赛前，NBA的总决赛，任何前两场打到1比1的，谁赢第三场谁冠军——依照这定律，今年骑士冠军。\n\n但2011年总决赛和2013年总决赛，迈阿密热赢了2011年第三场却丢了总冠军，2013年输了第三场却赢了总冠军，所以……似乎这定律近年又不准了。\n\n而今年季后赛，所有打到1比1，之后赢第三场的，结果都糟糕了。比如公牛对骑士，比如马刺队快船，比如快船对火箭，比如勇士对灰熊——按照这定律，今年勇士冠军。\n\n说来说去，一切定律都是待推翻的，只有科比永远硬气。第二场比赛结束后，鉴于勒布朗前三场107发投篮，第三场34次投篮，有了这么条推特：\n\n![](/static/upload/201506151701223.jpg)\n\n今天，科比可以很自傲地说：“勒布朗今天没赢，是他没有投足够多的‘科比式投篮’啊！”\n\n最后，利文斯顿第一节差点完成本届总决赛最漂亮一球——底线起跳，滞空，被拽住犯规，依然将球砸到了篮筐边缘。如果再顺一点，就是一个扣篮了。每次利文斯顿做出类似动作，我总想有个谁录下来，然后给保罗-乔治去看看。\n\n**“你看，把腿伤养好了，照样可以在总决赛飞的！”*\n\n\u003cHR\u003e\n\n#### 来点调剂\n\n![](/static/upload/201506151848478.gif)\n","Tags":["NBA"],"CreateTime":1434358798,"EditTime":1434365357,"UpdateTime":1434358798,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[],"Hits":187}