{"Id":229,"Title":"2015总决赛结局：勇士登顶，以及，我们正在观赏伟大这个词的全部含义","Slug":"2015-06-17-1","Text":"第六场前，科林斯和杰伦-罗斯围着韦德讨论：如果勒布朗输了，能不能拿到总决赛MVP呢？大家的口气，仿佛韦德是勒布朗的亲爸爸：\n\n“看着儿子单飞了，有什么看法呀老先生？”\n\n韦德有点不爽了，打断罗斯，提醒他先别讨论勒布朗输了怎么办，“他满有机会赢总冠军呢！”\n\n然后他回忆起三年前的光荣岁月，对凯尔特人那传奇的第六场前。他说当时但见勒布朗表情木然，不知是忧是喜。直到开赛前，勒布朗做了一个表情，韦德便知道没问题了——那就是勒布朗半场30分、全场45分、震服波士顿花园之夜。\n\n韦德学了一下，那表情是这样的：\n\n![](/static/upload/201506171820556.png)\n\n而今天比赛前，勒布朗的表情是这样的：\n\n![](/static/upload/2015061718205910.png)\n\n哦对了。最后一件事。\n\n韦德今天解说时，说到“我以前在迈阿密的时候……”\n\n他和迈阿密的合同问题，众所周知。这是他要离开迈阿密了么？\n\n\u003cHR\u003e\n\n业已进行的战局，我们都知道了：\n\n+ 第一场战得难解难分，然后欧文受伤。\n+ 第二、三场，骑士放任巴恩斯、格林和博古特不管，夹击库里，放慢节奏，干掉了勇士。\n+ 第四场，勇士上伊戈达拉首发，替下博古特，全小球阵容。再利用库里+格林挡拆联动，干掉骑士。骑士用双内线居高临下冲了12个前场篮板合计25投16中，无效。\n+ 第五场，勇士继续伊戈达拉首发，骑士也用小球阵容应对，但关键时刻，依然被库里——格林——伊戈达拉连线击败。\n+ 第六场了。\n\n八年前，凤凰城太阳与马刺西部半决赛第二场，被迫用上科特-托马斯首发，放弃全小球速度。理由？第一场，太阳上纳什+贝尔+詹姆斯-琼斯+马里昂+小斯塔德迈尔。结果：邓肯33分16篮板，帕克突破随心所欲32分。\n\n反过来，达拉斯小牛首轮战勇士，最后勇士排了巴朗-戴维斯+理查德森+巴恩斯+杰克船长+别德林斯+皮特鲁斯+埃利斯七人轮换，只有别德林斯一个内线。小牛不敌，因为德克那时还没练出无敌的背身后仰金鸡独立，根本无法搞定勇士内线。\n\n第四场，骑士用内线攻勇士，未遂；第五场，骑士陪勇士跑，未遂。第六场，布拉特教练决定，内线。\n\n骑士开局的攻防：香波特、莫兹科夫、特里斯坦、汤普森，人人都往内线去强攻篮下，趁乱抓篮板；防守端，强侧施压，弱侧则尽力切断传球线路。赌注下得不小：伊戈达拉、库里、克雷-汤普森们都有空位机会，但投不进。骑士一波7比2。那是他们全场气势最盛的时候。\n\n然后，伊戈达拉出来了：\n\n造了勒布朗的进攻犯规。挡住莫兹科夫让格林上篮。抄掉勒布朗的球让库里反击上篮，阻绝球。骑士半节5次失误，因为伊戈达拉对勒布朗的组织思路很理解。\n\n反过来，伊戈达拉的组织就没人管。他在弧顶呼风唤雨，莫兹科夫只好在禁区呆看。伊戈达拉中投、找库里、投三分。到库里——巴恩斯——伊戈达拉一条连线完成后，勇士23比15领先。\n\n到这里，骑士赌输了：他们继续不管伊戈达拉，希望他的手冷，然而伊戈达拉连投篮带组织，随心所欲。前十分钟，勇士投进10个球10个助攻，骑士则多达7个失误。第一节勇士28比15后，骑士的双内线攻势，算是失败了。\n\n![](/static/upload/201506171821078.png)\n\n第二节，骑士换套路，勒布朗试图多找两个内线挡拆来突破分球，防守端尽量阻绝传球后单打。莫兹科夫在禁区送出3个封盖。骑士追分时，又是伊戈达拉：反击中回传巴恩斯三分球，37比29。\n\n然后就是他的第三次犯规。下场休息。然后就是骑士一口气追到43比45，半场只差2分。伊戈达拉下场的3分钟里，勒布朗得到6分。实际上，勒布朗半场14投6中。\n\n半场休息时，杰伦-罗斯又自得其乐嚷嚷“勒布朗继续突破！你会得到哨子的！不要跳投！”——半场骑士21次罚球，勇士4次。\n\n韦德听不下去了，插嘴：“勒布朗是个组织者！他是试图让每个人融入进来！”\n\n的确如此。下半场一开始，勒布朗继续找双内线，莫兹科夫和特里斯坦-汤普森各一个上篮后，骑士47比45反超。\n\n那是今天他们最好的机会，但是：\n\n+ 伊戈达拉抄球，巴恩斯追身三分。\n+ 巴恩斯断球，伊戈达拉反击扣篮。\n\n骑士只好放弃莫兹科夫。注意：骑士每次替下莫兹科夫，都意味着“我们防守端就是拿伊戈达拉没办法！”\n伊戈达拉突破，伊戈达拉扣篮，加上利文斯顿的妖异、库里的反击，骑士勇士领先到61比51。\n\n此后是漫长的胶着，直到第四节，勒布朗弱侧抄球突击前场奋力扣篮，重新点燃球场。但之后：\n\n\u003e 常规赛MVP出现。库里三分球，利文斯顿补扣，JR史密斯三分球，但库里——格林——伊戈达拉连线还以三分球。库里和克雷-汤普森再补两个三分球，加上库里——格林——伊戈达拉连线的三分球，勇士领先到92比77。\n\n以及：勇士的每一次小球阵容快速缩放：\n\n![](/static/upload/201506171821145.png)\n\n![](/static/upload/201506171821212.png)\n\n勇士输了无数篮板，但他们同样造了无数失误。这场赌局，他们赢了。\n\n在每一个骑士可能起势的瞬间，伊戈达拉都稳稳地梗住了骑士——也梗住了勒布朗的咽喉。最后时刻，JR史密斯的连续三分球，仿佛两年前马刺vs热第六场超级翻盘的阴影重现，但伊戈达拉又跳出来，抓了两个后场篮板。\n\n然后，金州勇士四十年的等待，得到了回报。\n\n\u003cHR\u003e\n\n克里夫兰骑士拼到了最后时刻。就在JR史密斯迟来的三分球不断坠入篮筐时，解说员布林老师诧异地道：\n“骑士还在战斗？”\n\n——因为早五分钟前，他已经和范甘迪聊起“明年骑士会不会变得很强扒拉扒拉”之类话题了。\n\nJR史密斯在第五场上半场与本场最后几秒钟，让系列赛显得刀光剑影。\n\n詹姆斯-琼斯和迈克-米勒作为勒布朗的私人武装……做得可以了。\n\n德拉维多瓦已经靠第二和第三场一举成名，而且伊戈达拉应该给他写封感谢信。\n\n特里斯坦-汤普森本系列赛场均10分13篮板。会有球队愿意付他三年4500万的。\n\n莫兹科夫证明了，在一个博古特都站不稳的舞台上，他站稳了。\n\n巴博萨在第五场为太阳队挣回了面子，今天第四节他一个底线上篮时，布林老师诧异地：“啊居然是巴博萨在屠杀骑士”——嘿，有那么让人奇怪吗？\n\n——这倒让人想起一个话题：巴博萨、迪奥和马里昂这些太阳旧将，都从勒布朗身上得到了戒指；当然，论这方面，谁都不如詹姆斯-琼斯。\n\n利文斯顿是这个系列赛的暗影游魂，每次勇士吊不过气来，他便拯救。\n\n克雷-汤普森……好吧，总决赛第二场他打得不错。\n\n德雷蒙-格林用一个三双结束了总决赛。会有球队朝他舞顶薪合同的了。\n\n巴恩斯在第五和第六场终于醒过来了。\n\n艾泽利今天的那记补扣打三分熄灭了速贷球馆的呼声。\n\n大卫-李代替博古特成为系列赛的转折点之一。\n\n\u003cHR\u003e\n\n布拉特教练做了他能够做的一切。在欧文受伤后，选择合适的轮换，激励士气，变换防守方式。一个细节：\n\n\u003e 总决赛前五场，骑士只放给勇士17个大空位（最近的对手在两米开外），反过来，骑士获得了27个大空位。\n\n\u003e 勇士在对手距离一米二到两米之间的准空位下，46投25中。而骑士在对手离自己起码两米的大空位，27投只有10中。\n\n\u003e 这是骑士防守的胜利，以及射术的大失败——当然，那就是另一回事了。\n\n关于斯蒂夫-科尔教练，举个例子。\n\n有个球员，叫做卢-阿尔辛多。在两年的NBA生涯里，他拿了一个常规赛MVP、一个NBA年度新人、一个得分王、一个总冠军、一个总决赛MVP、一次NBA二阵、一次NBA一阵。如果到此退役，他也必然是史上最伟大球员之一了——嗯，直到他1971年二年级时改名贾巴尔。\n\n同理。斯蒂夫-科尔教练如果现在辞职不干，也已经名垂青史了。常规赛67胜，新秀年总冠军，完美的人生。哪怕现在就退休，他也会因为勇士这支史上最伟大三分球队之一而被铭记，他会因为总决赛第四场开始伊戈达拉首发这个神话般的举措而被铭记。他真正做到了“五小球首发”，居然还能夺冠。虽然是天时地利人和，但老尼尔森、丹东尼、莱利、道格-莫们未能完成的伟大革命，他完成了。\n\n许多人因为勇士常规赛67胜，觉得他们夺冠理所当然，忘记了一些其他事。就在2014年10月，美国诸家媒体是这么说的：Bleachr预测勇士47胜35负；CBS的三位专家分别猜勇士会是西部第三、五和六；FOX体育预测勇士西部第五。那时节，大家可没有觉得勇士有那么堆山填海的重磅天分哟！实际上，那会儿大家还在担心大卫-李受伤、小奥尼尔远去，勇士的内线怎么办呢。\n\n他们的无私和团队精神成就了这一切，而科尔，当然是关键的关键。\n\n季前写的：\n\n\u003e 暂时看来，科尔是库里能找到的，最好老师。射手和射手是能彼此理解的；科尔有五枚戒指；在历史上最好的射手球队里（太阳，嗯）担当过管家；他懂战术（而库里是个愿意遵循战术的好孩子）。相比于马克-杰克逊那样更注重球员情绪激发的教练，科尔能给库里一些其他的提示。\n\n以及这件事：\n\n\u003e “我知道这话马上就会上推特，但我还是得说，斯蒂芬的高尔夫打得比迈克尔好。”科尔如是说。\n\n嗯。现在，他有资格说许多其他话了。\n\n\u003cHR\u003e\n\n斯蒂芬-库里这个总决赛MVP丢得有些可惜。他依然是球队第一得分手兼发动机，数据无法形容他对球队胜利的意义。我们只能一再回放库里——格林——任何一个空位球员的录像。连续四场比赛的第四节，他都让骑士胆战心惊。他是勇士的创造者，只差没有像勒布朗似的，将每个球喂到队友嘴里。格林的每次助攻，都该分他一半才是。\n\n![](/static/upload/201506171821234.png)\n\n但他好好歹歹，完成了一个伟业。虽然去年马刺夺冠，帕克是马刺首席得分手+助攻王，但没人会说马刺是帕克的球队；但从今以后，我们都知道，2015年总冠军是斯蒂芬-库里的球队。常规赛MVP和总决赛数据照耀着这一切。这是基德与纳什始终未能完成、只有魔术师与刺客完成过的伟业。当然，他不是一个纯控卫，但那是另一个话题了。\n\n\u003cHR\u003e\n\n安德烈-伊戈达拉。当总裁说“总决赛MVP是个一直没打上首发的人”时，我就想：呃。\n\n季前写的，勇士十点里，我把他放在了第二个。\n\n\u003e 伊戈达拉是上季勇士首席“光看数据根本不知道他干了啥”的家伙。他场均32分钟里9分5篮板4助攻，但是：\n\n\u003e 他出赛的63场比赛，勇士41胜22负。他没打的19场比赛，勇士10胜9负。\n\n\u003e 他的存在，以及博古特多打的1000分钟，让勇士的防守排名提高了十位。\n\n\u003e 虽然他有哈里森这个顶尖替补，但他上季的+/-值达到了全队最高的17.7，甚至超过库里。\n\n\u003e 当然，如果你愿意多提一句的话……失去了他的掘金，防守也跌到了谷底……但那是另一个话题了。\n\n\u003e 总而言之，离开了费城两年，伊戈达拉的数据连创新低，但在丹佛，他让掘金完成了队史纪录的57胜；在勇士，他让球队自1992年后再次达到51胜。顺便：勇士队史一共也才五次50胜。长此以往，他真的开始要变成翼侧的基德了：“我们不在乎自己的得分；我们什么都能干一点，不过也不想多刷；我们就想跑起来，让球队赢球，然后深藏功与名”。这很怪异，因为他大概是联盟里仅有的“场均得不到二位数分数或篮板或助攻却领着千万年薪还倍受赞誉”的人了。\n\n天晓得。入行时就被认为是未来明星，二年级开始被当做未来皮彭，2008-09季仿佛迷你勒布朗，但之后越来越证明他长了明星身子却只想当个角色球员，甚至让泰德斯-杨成为球队首席持球攻击手；当然，因为他的防守与全面从来不坐板凳，本季之前漫长的十年职业生涯全部首发——然后本季一直坐替补到总决赛第三场。\n\n忽然间，就天摇地动了。\n\n他的首发意义，不再赘言。他对勒布朗的防守，全世界都看到了。连续第二年，总决赛MVP给了一个“大家都觉得你有些像蓝领，然而你还是忽然爆发了，在总决赛最后三场跟勒布朗对着干，然后拿到冠军”的小前锋。\n\n而且，他是靠若干个定点三分球来刷分的——六年前，费城球迷都在念叨他和安德烈-米勒这俩货不投三分，实在是球队进攻的顽疾来着。\n\n可以很安全的说，不算莱纳德（他还有未来呢），伊戈达拉是NBA史上，第二草根的总决赛MVP，只有1981年的塞德里克-马斯威尔比他更草根。\n\n他一直是个好球员，但不够伟大；他只进过一次全明星，以后也未必能进。他得总决赛MVP，一半是他的卓越表现，一半是……他的出镜，太戏剧性了。\n\n当然，还有一个重要理由是：他对位的是勒布朗-詹姆斯。\n\n\u003cHR\u003e\n\n勒布朗-詹姆斯在2015年总决赛，完成了NBA总决赛史上最伟大的败者表演，可能没有之一。\n\n——当然，1974年总决赛，天钩七场场均33分12篮板5助攻2封盖，第六场送出传奇绝杀。1969年韦斯特场均38分，第七场三双。1967年巴里场均41分9篮板3助攻抵抗了张伯伦六场。1977年J博士场均30+6+5。其他包括1993年的巴克利、2001年的艾弗森，都上演了惨烈的对抗。\n\n但天钩身边有丹德里奇和奥斯卡（虽然老了）；韦斯特身边有贝勒和张伯伦；J博士身边有麦金尼斯。勒布朗，自从第一场后，确实只有他自己。他也确实做了一切。实际上，你可以问一个篮球手要的：持球、组织、远射、突破、罚球、单防、协防、篮板、封盖、长传、推反击、助攻空位队友、寻找空切队友、抛射、上篮、背身——他都做了一遍。\n\n这个系列赛在欧文倒下后，纸面悬念便已消失；奇妙的是，越是这类场合，勒布朗却似乎越能负隅顽抗，仿佛角斗士面对野兽般血战到底。韦德今天在赛前，重新提起那个话题：\n\n2011年总决赛，勒布朗需要思考这里要不要打，那里要不要打，然后就出问题了……当他不需要特意去思考这里那里时，他便所向无敌，“我就是保证他可以不用多思考”。\n\n很奇怪。勒布朗2006年与活塞、2007年与马刺、2008年与凯尔特人、2009年与魔术，都血战到了最后。2010年，他选择了那条众所周知的道路，但在2011年有所选择时，却输给了小牛。2013年，他在总决赛前五场患得患失，然后在第七场毫无退路时打出了不朽表现（单场37分）；今年亦然：在欧文倒下后，当他发觉自己无可依靠，必须独自解决一切时，勒布朗反而会打出他最好的表现——是否赢球那是结果，但过程方面，他处理得无可挑剔。包括今天，从开场让全队融入进攻，到自己的接管时机，到下半场悬念已经丢失，还在奋力挽回。\n\n系列赛前，他说现在的自己是最强的自己。如果看过2009年或2013年的他，便不难明白，如今他的面筐突击、远射与防守，都已不如巅峰期；2011年之后，他一直是在用自己日渐长进的投篮、大局观和背身来弥补爆发力的流逝，但这个系列赛，你可以理解“最强的勒布朗”的含义。这是我们所见过的，心志上——聪慧、斗志、热血——最完美的勒布朗。2011年，你可以说，他是明明可以做到却不做，那么今年确实，他的心尽到了，许多时候，只是短一点力。当然，你没法要求那么多：你可以说狮子捕不到鹰是因为没有翅膀，但那样要求就太违背自然了。\n\n但他好歹让克里夫兰骑士打出队史最好的一年，也让自己打出了职业生涯最好的一个系列赛。最重要的是，就像1998年的乔丹带着老去的双腿似的，我们一直想看“勒布朗如果真把自己压榨到极限，会是什么样子？”我们看到了。\n\n结果并不美妙，但就像2001年的艾弗森、1993年的巴克利、1988年的刺客、1981年的摩西-马龙似的，我们有了一个新的英雄故事。1988年那著名的第七场，伯德末节20分，威尔金斯全场47分时，解说员说：“你们在观赏伟大这个词的全部含义！”伟大巨星就是能把自己榨得一点不剩，这也是为什么2007年之前的KG、艾弗森、巴克利这些名字，伟大到能够让人们忽略他们结果是否得到戒指。\n\n勒布朗-詹姆斯的2015年总决赛之旅。很伟大，也因此让金州勇士的2014-15季之旅有一个精彩收尾。许多年后，我们不会说“勇士真正的考验在对灰熊就结束了”，类似于2003年马刺击败湖人后便仿佛一马平川了似的。勒布朗榨干了自己，上演了一场壮烈拼搏。有点残忍，但作为篮球迷，我们要的也就是这个了。\n\n“我们正在观赏伟大这个词的全部含义”，差不多就是这样。\n\nNote:\n\n\u003e 我不惮以最坏的恶意来揣测那些评FMVP的媒体，他们就是感觉LBJ没有实现英雄的胜利而打压库里(我这里没相对一哥不敬，他值得起FMVP)，他们媒体没有更好的理由来书写总决赛报道，没有能够把写好的《LBJ2015传奇》出版而怀恨在心才会给Curry零票的。\n\n\u003e 我不惮以最坏的恶意来书写LBJ的，他也有老去的时候，命中率在科铁的40%徘徊。\n\n\u003e 我不惮以最坏的恶意来评价LBJ带队的方式的，他总是能把角色垃圾代成中产，当然，也会把全明星联盟前十带成中产(前者参照07前骑士，热火老将们，骑士新锐们，后者参考韦德，波什，欧文，LOVE)。\n\n\u003e 我相信，骑士明年最坏的结果，是打进总决赛。\n\n\u003e 祝愿他们来年一路顺风，勇夺第二。","Tags":["NBA"],"CreateTime":1434536543,"EditTime":1434536701,"UpdateTime":1434536543,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[],"Hits":1457}