{"Id":223,"Title":"2015总决赛第三场：勒布朗和库里很伟大，但本场属于德拉维多瓦","Slug":"2015-05-15-3","Text":"\u003e 武力威慑，以牙还牙，《古惑仔》里阿坤说：出来混要讲信用，说杀他全家就杀他全家。\n\n\u003e 邓布舍欠了贝多芬的钱，贝多芬去讨债。邓布舍问：“非如此不可吗？”贝多芬答：“非如此不可！”——还把这句音韵写成了《命运》开头的重音。\n\n\u003e 篮球里，也是如此：\n\n\u003e\u003e 有债必偿。你放空我，我就得让你付出代价。\n\n\u003cHR\u003e\n\n说杀他全家就杀他全家=西部半决赛，灰熊用兰多夫守格林，被格林+库里挡拆打得摸不着门。\n\n或者更极端的例子：九年前，猛龙坚持全场单防科比，不夹击，然后科比81分。\n\n反例呢？四年前的总决赛，小牛用基德甚至巴里亚，去挡勒布朗的背身，收缩阵线让勒布朗和韦德跳投：\n“您请您请，这个我豁出去不要了……哟？您客气啊？那我得罪了。”\n\n第二场库里被锁死，是因为他每次无球走位，都遭遇德拉维多瓦；每次挡出机会，骑士换防；每次他持球，骑士送两个人过来。\n\n骑士当然付了代价：博古特放空了，格林放空了，巴恩斯半放空了——然而博古特投不进，格林投不进，巴恩斯单打德拉维多瓦居然也不成。这就算是降住了。\n\n反过来，勇士对付勒布朗，是每次他突破都要两三人夹击。结果？勒布朗后22投4中，最后7投0中，但他依靠不断突破分球，给队友塞三分球助攻；而且，特里斯坦-汤普森趁勇士全体围剿勒布朗，统治了前场篮板。\n\n骑士的进攻端策略，并没什么好说。勒布朗持球单打，队友散开等着投空位；勒布朗背身单挑，队友散开等着投空位；德拉维多瓦在弱侧趁乱挡拆抛射；JR史密斯风骚地单挑；特里斯坦-汤普森冲前场篮板；莫兹科夫弱侧内切袭篮。\n\n前两场，骑士全队命中率37%，三分率31%，勒布朗两场投篮72次，场均41.5分，送出全队33次助攻中的17个。今天用了34次投篮和12次罚球得到40分8助攻（全队助攻15次）。就是这样了：\n\n\u003e 反正，你一对一防勒布朗，他能得分；你夹击，他分球；你不中，他追身反击。效率高不到哪儿去，但也不低。跟哈登西部决赛五场比赛投90个篮得到142分比，勒布朗三场比赛投106个篮得到123分，那肯定没法比；但勒布朗担负的要沉重得多。反正无论勇士怎么防，他总有法子就是。进攻端，骑士不会神到哪里去，但有勒布朗这个变形金刚万能输出机，随时变身突破/背身/分球机器/快攻启动，怎么着都是这样。勒布朗近三场的真正秘诀，是他的坚决。投不进还是投，突破累还是突。今天上半场虽然17投6中，但有13次投篮是在禁区里——就是撞破南墙不回头的气势。\n\n近两场比赛，骑士的秘密，在防守。\n\n第三场，骑士的防守策略，依然如此：\n\n+ 库里无球走位，德拉维多瓦死缠到底。不行就换防。\n+ 克雷-汤普森，限制他投三分，允许他中投。\n+ 格林的三分，放空；巴恩斯的三分，可以放空；博古特，可以不把他当人看。\n+ 伊戈达拉，可以放空；利文斯顿，三分线外不理他。\n\n如此这般，绞杀库里。\n\n##### 勇士的应对手段？\n\n库里每次都能吸引夹击？好，就给其他放空的队友吧。\n\n这其实，可以理解为库里在呐喊：“我吸引他们注意力，你们负责灭门！——勒布朗被夹击队友能投进球，你们也拜托拜托吧！”\n\n问题来了：\n\n\u003e 从一开场，库里便随时被夹击，但格林被放空到这程度，却还是投不进。\n\n![3-1](/static/upload/201506151654201.jpg )\n\n库里想推反击追身？骑士全队都会放弃格林或博古特，来刹车，甚至可以一过半场，就给他来个夹击。\n\n![3-2](/static/upload/201506151654345.jpg)\n\n![3-3](/static/upload/201506151654289.jpg)\n\n格林第一次有效捕捉空位，是第一节过半，面筐突破打三分那一下。但自那之后，他的进攻哑火了——前两场，格林命中率30%，今天10投2中。\n\n懂得利用库里空位的人是有的。比如：伊戈达拉第一节那个扣篮，就是利文斯顿看着库里空切、吸引了勒布朗+德拉维多瓦的注意，于是直塞过去。\n\n![3-4](/static/upload/201506151654378.jpg )\n\n可以说，伊戈达拉和利文斯顿是全队替补最聪明的二位，但要命的是：他们二位，看得见，想得到，但手上不够稳。利文斯顿是不会三分球的，伊戈达拉是个三分半吊子。\n\n实际上，伊戈达拉自己还做了许多事：他持球时，勒布朗在防守，等于将骑士的协防抽干了筋血，于是伊戈达拉自己投三分、找空切队友。但他三分不够稳。\n\n勇士真正的问题是谁呢？格林和巴恩斯。博古特被放空却不得分，那是能力所限。但格林得到无数空位却无法惩罚对手，巴恩斯今天8投0中，从中投到定点三分一片稀烂。\n\n类似这样的机会还8投0中……而且还犹豫不决：\n\n![3-5](/static/upload/201506151654512.jpg)\n\n![3-6](/static/upload/201506151654567.jpg)\n\n\n加上利文斯顿进不了三分球、伊戈达拉三分球不稳，忽然间，历史最顶级三分球勇士，变成一支投不进三分的队伍了。\n\n骑士这个思路，和当年禅师是暗通的。禅师很爱玩这个：坦胸露怀恶狠狠夹击，“你有本事投死我，投不死我我就拍死你”。斗狠，骑士胜了一筹。\n\n下半场开始，库里自己被夹击，于是连找两个博古特的高位挡拆，让博古特得了今天全部的4分，但这也只是饮鸩止渴。\n\n![3-7](/static/upload/2015061516545910.jpg)\n\n反过来德拉维多瓦找着库里挡拆、绕过掩护揍汤普森，很得意。\n\n第三节中段，艾泽利上场是勇士的大痛点：骑士肆意夹击勇士，艾泽利一拿球就被钳死；勒布朗再接管比赛——连续的右腰启动到禁区背身后仰投篮——勇士就被甩开。\n![3-8](/static/upload/201506151655056.jpg)\n\n到最后，科尔终于掏出了一个法宝。\n\n第三节下半段，库里开始接管比赛。强行三分、绕掩护中投、吸引夹击助攻巴博萨。\n\n以及：找全队年薪第一人出场：1500万的大卫-李先生。\n\n大卫-李的防守不及博古特，运动不及艾泽利，全能不及格林，但他有两个好处：接到球能传球——比如，库里被夹击，他接球后，还能找到伊戈达拉。\n\n![3-9](/static/upload/201506151655167.jpg)\n\n![3-10](/static/upload/201506151655178.jpg)\n\n或者，自己接到库里被夹击后的传球，也能完成上篮——和罚球。\n\n勇士找到这招后，一度落后20分的局面被扳回。骑士比赛后半段，再次显得办法不多。勒布朗右腿疑似抽筋，已经跑不动，只能靠反击和罚球得分。当库里神话般的三分追到80比81时，骑士眼看要垮了。\n\n然后，真英雄再次出来了。\n\n骑士开场，德拉维多瓦单挑克雷-汤普森两个抛射得分，让骑士10比5领先。\n\n第一节最后时刻，德拉维多瓦在死角把球往天上一抛，“特里斯坦，我知道你接得住啊！”\n\n下一个回合，他和迈克-米勒为了个球权滚得一地鸡毛。\n\n下半场一开始，德拉维多瓦找着库里打挡拆投中三分，再绕掩护一个抛射；之后接勒布朗传球三分得手让骑士领先10分。\n\n还有一个神奇的空中补篮得手，骑士63比48领先。\n\n说回比赛最后时刻。库里三分得手，勇士80比81落后，然后：德拉维多瓦倒地，球出手打板得分，加罚。骑士重新领先4分。那是本场比赛最关键的瞬间。\n\n至于之后不到两分钟的比赛，他一共为了球权摔地四次，反而不在话下了。\n\n勒布朗尽力了，不多提。本场他真正的亮点，是第三节的封盖和一波引领反击。至于其他，于他而言只是中规中矩——哦对了，总决赛前三场得到123分，是迄今为止的NBA记录。之前的记录是1967年的里克-巴里。当然，勒布朗三场出手106次投中43个是不太好看，不过巴里在1967年第一场43次投篮和第三场48次投篮也真够瞧的……那会儿巴里还没开发出组织前锋属性，1967年总决赛第三场他48投得到55分，之后非官方统计说他全场一共传球11次……好吧，这是闲篇。\n\n![3-11](/static/upload/2015061516552910.jpg)\n\n库里也尽力了。全场比赛他27分6助攻，以及二位数的“库里吸引夹击——分球给队友——队友再分球给其他人”的二次策动。最后一节的追杀无愧天下第一神射手。\n\n所以这其实可以概括为：勒布朗被夹击时，他的队友把球投进了；库里被夹击时，他的队友没把球投进——确切说，就是格林和巴恩斯。科尔教练在最后找到了大卫-李，但稍微晚了点。当然，最后那几下，是德拉维多瓦的个人传奇。\n\n值得一提的细节倒是：\n\n\u003e 当库里被锁死后，勇士居然没有持球攻击点。本来巴恩斯的持球单打、克雷-汤普森的背身、格林的面筐、利文斯顿的单挑和伊戈达拉的一条龙都是有的，但克雷被针对性对待，利文斯顿遭遇收缩后，巴恩斯和格林的单挑莫名其妙消失了。反过来，今天JR史密斯摇曳生姿的单挑和德拉维多瓦的绕掩护抛射，恰好是勇士需要的——勇士居然输在了定点三分球和单挑上，说来也讽刺。\n\n所以勇士需要什么呢？根据下半场的经验，他们得多给库里设立持球掩护，多用用大卫-李（或者斯贝茨），给博古特设计点可以得分的套路，当然，最好的法子还是敲敲巴恩斯和格林的警钟——“该你们俩独的时候，做点狠事儿啊！出来混要讲信用，给你们机会就要杀他们全家啊！”\n\n但在此之前，到现在为止，布拉特教练是赌赢了的。\n\n凯撒在《高卢战记》里说过个经验：当双方都紧张时，能克服紧张的一方往往能够先制，所以临场犹疑实为自己真正的大敌。搁现代战场上就是“你越怕子弹越打你，你越不怕子弹越打不中你”的思路。骑士的诸位射手们，也就是赢在了“不怕”上面。当然，这信心不是凭空而来的。有一个超级王牌，信心的确不一样。\n\n最后一个问题：\n\n\u003e 以德拉维多瓦迄今为止的攻防两端表现，以及他与香波特类似的、为球队注入的韧劲和狠劲……假设欧文这时没受伤，他和欧文该谁首发呢？这个问题如果总决赛前提出来简直荒诞，但现在想一想的话……\n\n所以，这场比赛前三节属于勒布朗，第四节属于库里，但归根结底，属于德拉维多瓦，属于他那些抛射、追防和无数次橄榄球达阵般倒地扑球。这出来混就不回头的热血与不屈不挠。\n\n**勇士恰好，就输在这里。**\n\n\u003cHR\u003e\n\n#### 来点调剂\n\n![](/static/upload/201506151823434.gif)\n\n![](/static/upload/201506151827034.gif)\n\n![](/static/upload/201506151821378.png)","Tags":["NBA"],"CreateTime":1434358667,"EditTime":1434364742,"UpdateTime":1434358667,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[{"Id":13,"Author":"are you ok","Email":"15327526516@163.com","Url":"http://www.baidu.com","Avatar":"http://1.gravatar.com/avatar/50c67d5509f5af7920aa400e5feb21bf?s=50","Content":"tinghao","CreateTime":1488284732,"Cid":223,"Pid":0,"Status":"approved","Ip":"127.0.0.1","UserAgent":"Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/56.0.2924.87 Safari/537.36","IsAdmin":false}],"Hits":867}