{"Id":217,"Title":"2015总决赛第一场：勒布朗霸王神勇，然而未能过乌江","Slug":"2015-06-15-1","Text":"上一次NBA总决赛第一场便打加时？2001年总决赛。\n\n上一次NBA总决赛有人得到单场44分以上？2001年总决赛第一场——艾弗森48分，鲨鱼44分20篮板。\n2001年，也是常规赛MVP、天下第一精灵后卫（阿伦-艾弗森）与联盟实际上的霸王（鲨鱼）碰面。\n今天，常规赛MVP精灵后卫库里和联盟实际上的霸王勒布朗撞上了。\n\n真巧合。\n\n\u003cHR\u003e\n\n2015年总决赛第一场的前50分钟，尽善尽美的，有你想要的一切：大比分领先（骑士第一节一度29比15领先），逆转（勇士反超，比赛最后时刻还领先3分），反逆转（骑士追平），足以成为话题的“如果”（欧文盖掉库里的绝杀上篮），个人神威（勒布朗-詹姆斯常规时间不可阻挡的42分），戏剧性场面（第一节末和第三节末伊戈达拉各一个扣篮）。\n\n但最后三分钟，比赛结束得有些快了。\n\n开场的一切，没出太大意料：克雷-汤普森对位欧文；双方都竭力推速度；骑士用大量换防对付勇士的挡拆；勒布朗开场便恶狠狠地左腰要位背身单打。半节下来双方8比9，跳投手感都很糙。到此为止，比赛是博古特的内线统治vs勒布朗的为所欲为——你也可以看成是赤木刚宪vs牧绅一。\n\n但这个节奏，是骑士喜欢的——实际上，全场的节奏，都是骑士喜欢的。\n\n骑士5分钟打出17比2，靠的是以下手段：\n+ 无限换防，欧文死追库里。库里前6投2中。\n+ 勒布朗和欧文大胆追身反击。\n+ 汤普森和莫兹科夫冲前场篮板。\n+ 勒布朗左腰要位后，或背身单挑，或找汤普森和莫兹科夫的内切袭篮。\n\n最重要的细节：**骑士的前场篮板+退防，实在太好**。双内线尤其是汤普森袭击每个前场篮板，同时两翼提早退防限制勇士一传。领防库里运球推进时，还不忘过半场扩一扩汤普森。勒布朗甚至连个罚球不进前场篮板都要去抢。\n\n切割空间，寸土必争的壕沟战。JR史密斯三分得手，骑士29比14领先后，勇士看上去有麻烦了。\n\n但昨天写过了：**勇士是可以无限变形的多面体**。\n\n*斯贝茨……*常规赛时是球队首席替补内线，作用堪比两年前的兰德里，角色类似于穷人版大卫-韦斯特，但季后赛被艾泽利代替……他与大卫-李一样代表了传统好内线：能得分，有技巧，但防守端缺乏速率，不足以抵上他们进攻端的优势。在这个“内线防守好进攻时负责挡人和内切接球就好了”的时代，他和大卫-李的价值主要是奇兵。\n\n第二节，斯贝茨成了奇兵。骑士用换防+锁三分线+空禁区，欺负博古特没射程，格林犹豫不敢中投，于是斯贝茨上来。外加伊戈达拉、利文斯顿和巴博萨领衔的第二部队。\n\n斯贝茨的所作所为：勇士逼出换防后，由他背身单打香波特；然后是两个中投，再高低位连线助攻格林上篮，勇士追到33比36。\n\n然后便是库里：用挡拆逼出换防后，用无球走位摆脱汤普森，底角三分点燃比赛，再追身三分，勇士39比36反超\n\n昨天写过这套路：\n\u003e 勇士的挡拆，骑士可以用无限换防来对付。但假设骑士换防，没有内线可以对位库里，除非让勒布朗防格林，然后换防库里。反过来，火箭也用换防追过库里, 然并卵，被勇士用换防后的无球走位给破解了。\n\n\n之后，骑士进入了勒布朗和欧文节奏。\n\n从第二节被反超直到比赛结束，骑士的套路一言以蔽之，便是：\n+ 勒布朗左腰无限背身单打。被夹击就分球。\n+ 勒布朗与欧文各自清空一侧后找挡拆。\n+ 比赛末尾，勒布朗和欧文打挡拆，偶尔加入第三者做掩护。\n\n杰夫-范甘迪在第四节很不高兴：`“太多单打了，我真不喜欢。”`\n\n刚说完，勒布朗绕过掩护跳投得手，旁边只好帮腔：`“有效就好了嘛！”`\n\n直到48分钟的最后一刻，骑士还有赢球希望的, 但进了加时，就是另一回事了。\n\n\u003cHR\u003e\n\n昨天写的：\n\u003e 布拉特教练的应变有一点远胜过斯波厄斯特拉教练：他没有一根筋的“双人夹击赌博到死”，而是会针对性使用各类防守策略。夹击持球者、换防、硬延阻或软延阻，收缩或对球施压，都很溜。但进攻端，骑士的套路主要是：勒布朗和欧文各一侧，找高位挡拆；汤普森和莫兹科夫各一侧找挡切，转移球到弱侧；如果无效，就换小个阵容，勒布朗进左腰背身单打……\n\n勇士的调整是全队的，因为库里、汤普森都有持球和无球走位技能，格林尤其全面，做什么都行；巴恩斯、伊戈达拉、利文斯顿也可以随便拆卸配成超小个阵容。每个人都是零件，随插随用，尤其是格林。怎么都拼得成型。\n\n而骑士的调整，基本是练勒布朗。\n\n今天的骑士，用一句话来形容，那便是大卫-布拉特教练上半场的怒吼：\n\n\u003e “绝不能丢掉专注力！不能走神哪怕一分钟！”\n\n是的，全队专注，然后就是看勒布朗。\n\n他们的领先，依靠的是勤奋专注地换防、切割勇士的传球线路、逼迫勇士单打。汤普森15个篮板球包括6个前场篮板，莫兹科夫的内切得到1分。香波特4个抢断，而且总在做各类小事情来为骑士获得球权。\n欧文是最感人的。23分7篮板6助攻4抢断只是小事，他不断游动找挡拆也无所谓。但他几乎靠着防守为骑士赢了比赛。\n\n欧文？防守？？但他结结实实盖掉了库里两个帽，尤其是48分钟末尾那一下。如果骑士赢了，这会是传说。\n\n但勇士赢球，是另一种方式。\n\n巴恩斯在下半场一度接管了比赛。\n\n格林一直在无微不至的做掩护和挡拆。\n\n博古特开场那两个封盖不提，全场骑士都在试图“单侧清空，吸引博古特注意，转移弱侧”，简直是大白鲨。\n\n汤普森在第四节单挑欧文那段锁住了比分。\n\n利文斯顿做了一切小细节勾当。\n\n伊戈达拉在第一节末尾扣篮挽回了一点士气，第三节末尾抄掉勒布朗的球扣篮追平比分是为功臣。而且，他一改巴恩斯第三节“逼勒布朗走中路”的套路，几乎是勾引勒布朗底线翻身跳投——效果并不坏。\n\n斯贝茨8分钟得了8分，中投如神，全场第一奇兵，真真是大卫-韦斯特般的表现。\n\n艾泽利在加时赛作为首发出场配小球阵容，控制了禁区。\n\n巴博萨和利文斯顿一起推了许多次快攻。\n\n库里在第二节中段接管比赛反超，在加时赛靠四个罚球拉开比分。而且，他一直在利用自己的牵制力，给克雷、斯贝茨们送球。\n\n勇士的火焰是断续而来的，开场是博古特，此后是利文斯顿和伊戈达拉，第二节是斯贝茨与库里，然后是巴恩斯和汤普森。他们变了无数阵容，加时赛用艾泽利配小球阵容出场绝对惊艳。每个人都参加了一点变化。\n\n而骑士，还是勒布朗。\n\n\u003cHR\u003e\n\n比赛开始前，勒布朗满脸都是*“老子来过这里，老子对这里很熟悉”*的表情，迈克-米勒朝他尖叫，仿佛士兵鼓励元帅：\n\n\u003e “统治比赛吧！统治！！”\n\n他也确实做到了。\n\n比赛前半节，得到7分。上半场19分，第三节12分，第四节10分。\n\n背身靠打，强行突破，无休无止。三分球只是偶一为之，其他时候，坚决地、恶狠狠地背身攻击篮筐。巴恩斯、格林、汤普森、伊戈达拉换了一茬又一茬，但勒布朗的背身单挑无法阻挡——不只是命中率，还有他的势头。\n\n上一个这样在总决赛肆无忌惮背身碾压对手的球员？嗯，鲨鱼……\n\n长久以来，可以挑剔勒布朗的，便是他比赛中的选择。2011年总决赛第二场开始，他犹豫了；2013年总决赛前三场，他不太肯投篮；2007年东部决赛第一场把绝杀球让给马绍尔，2010年对凯尔特人第五场拒绝突破篮下——总是如此。\n\n所以，每当他打出2007年对活塞48分包括连续25分、2012年对凯尔特人第六场上半场30分全场45分那种果毅刚烈的比赛时，便让人无法不想：\n\n\u003e “如果他就这么一路杀气四溢打下去，多好！”\n\n今天便是这样。勇士不夹击勒布朗，看他是否能一个人解决比赛；而勒布朗也老实不客气，一路碾压背身。这种杀气，是鲨鱼式的。“你们不夹击我，不信我一个人搞得死你们是吧？”\n\n而且他真的，差点就赢了。这一晚，他的打法活脱是鲨鱼，但他的杀气，真的就像十四年前的阿伦-艾弗森。\n\n上一次勒布朗输得如此热血？2008年对凯尔特人第七场，在波士顿花园的45分。\n\n一个细节可以告诉你，勒布朗的统治有多可怕。第四节剩9分钟，勒布朗走到场边预备出场时，甲骨文球馆发出了一阵情感复杂的吁叹声，就像看见一个电锯杀人狂正走向你似的。\n\n比赛剩3分半，库里单挑勒布朗中投，勇士94比93领先。下一回合，勒布朗背身单挑伊戈达拉，翻身底线跳投。不中。\n\n甲骨文球馆发出了到那时为止，全场最大的欢呼。仅仅是对方投丢了一个球。那种声音，就像“他居然没进？我们劫后余生了！我们太幸运了！”\n\n所谓统治力，也无非就是对方会为你的每次失手而庆幸。因为大家预设了：这家伙所当者破，所击者服，简直不可阻挡。\n\n这一晚，霸王神勇，但到底输了十面埋伏；欧文的防守让骑士得以溃围到了乌江边，但库里们，到底没放骑士过去。\n\n哦对了：\n\n\u003e 马克-杰克逊老师每次在解说里出镜，都是一脸瘪着嘴:\n\n\u003e\u003e “我前妻选上世界小姐了，现在正在跟休-杰克曼拍恋爱真人秀呢，而我还得给他们在一边做解说”的表情\n\n\u003e 实在是太棒了……\n\n\u003cHR\u003e\n\n#### 来点调剂\n\n![](/static/upload/201506151831489.gif)\n\n![](/static/upload/201506151831012.gif)","Tags":["NBA"],"CreateTime":1434357921,"EditTime":1434365833,"UpdateTime":1434357921,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[],"Hits":182}