{"Id":226,"Title":"2015总决赛第五场：这样的英雄故事，就是篮球运动存在的意义","Slug":"2015-06-15-5","Text":"\u003e 天正十年暨1582年夏天，织田信长焚没于本能寺大火中。羽柴秀吉星夜回师，五日奔走二百公里，先踞天王山，得了先机，一战破明智光秀。\n\n\u003e 至于一年后贱岳之战破柴田胜家平定家内，再一年后小牧长久手与德川家康扯平，五年后围小田原……嗯那是《太阁立志传》的事……\n\n天王山，得之得先手。之所以叫这鬼名字，是因为山腰有山崎天王社，祭祀牛头天王。\n\n战争打的是士气。数量优势与质量优势，都是士气。\n\n双方甲兵陈列时，靠的是将帅筹谋。三千铁甲竟不能挡，那是武侠小说。\n\n但倘若进了散兵乱战，猛将就有机会，策马刺敌将于万众中，百万军中取上将首级——当然，还是士气。十万敌军，项羽砍一年都砍不完。\n\n篮球也是这样——偶尔会有科比三节62分比小牛全队还多的事儿，偶尔而已。\n\n\u003cHR\u003e\n\n总决赛第四场，勇士变阵，大胜骑士。变阵的意义，并不在于让伊戈达拉首发，还在于让博古特下场。实际上，全场比赛，博古特只打了3分钟而已，今天索性没打。\n\n去年马刺总决赛打到半途，用迪奥代替斯普利特；2013年总决赛打到第六场，热用迈克-米勒替下哈斯勒姆。联盟的趋势，是大前锋日益摇摆化，各队通常只留一个巨人在禁区。当然，这个巨人，通常断不可少：\n勇士得留着博古特，快船得留着小乔丹，火箭得留着德怀特，公牛得留着诺阿，每个联盟强队，无论打得多华丽，禁区里一定要站一个防守擎天柱。防守端不碍事就行。\n\n科尔教练的疯狂处，在于他撤下所有的传统长人，放全摇摆阵容。这种疯狂程度，老尼尔森与丹东尼都未曾有过。骑士的策略，是疯狂攻击内线，结果全场比赛，勇士抵死不退，任凭莫兹科夫得到28分，骑士双内线合计25投16中刷到12个前场篮板，勇士要自己的节奏。\n\n这就好像，勇士撤下了大盾甲士，让轻骑出阵乱箭纷发；骑士这边，勒布朗中军指挥，让重甲士莫兹科夫冲阵取中路——虽然自己这边被射得不善。\n\n第五场开始，也是如此：\n\n勇士继续摆小球阵容，当骑士给双内线喂球时，快速夹击强侧；谁拿球谁推反击。一开场，骑士被闪电战打到2比8落后。勇士就是欺负骑士慢，靠速度强侧夹击，快速轮转，靠速度追击。打到8比2时，骑士第一次变阵。\n\n![5-0](/static/upload/201506151706578.jpg)\n\nJR史密斯替下莫兹科夫。以一大四小对勇士的五人快打旋风。\n\n但还嫌不够，于是，布拉特教练玩出更绝的一招：第一节剩3分40秒，骑士11比16落后，詹姆斯-琼斯替下特里斯坦-汤普森，骑士场上体格最大的，只剩下了勒布朗——骑士以五人小球阵容还击勇士，三分线里基本空无一人，勒布朗可以肆意突破分球。\n\n结果：一波11比6后，双方22平进入第二节。\n\n![5-1](/static/upload/201506151708412.jpg)\n\n![5-2](/static/upload/201506151707167.jpg)\n\n上一场，骑士坚持巨人阵容，想用前场篮板和内线攻势压垮勇士；本场，骑士便是以小对小，散兵阵容对决。\n\n于是：前几场命中率低迷的两队，本场半场打出51比50的不低比分。库里9投6中15分，勒布朗15投8中20分8篮板8助攻。\n\n威斯布鲁克喜欢坎特+伊巴卡的锋线，因为坎特+伊巴卡可以给他腾空间。\n\n当年科比每逢奥多姆替下拜纳姆，就会手感顺滑，呼风唤雨。\n\n勒布朗希望所有的内线搭档都像波什似的，老老实实练定点三分。\n\n都是为了这个，仿佛许褚裸衣战马超的意思：盔甲卸了，大家战个痛快。\n\n经过四场总决赛，经过第二、三场博古特被放空后，科尔决定打小球；经过第四场重甲内线冲阵不利的教训后，布拉特教练决定小球奉陪。终于在今天，骑士与勇士将各自的重型内线搁在一边。战场清空，勒布朗和库里不用在后面发号施令指挥了。\n\n决个胜负吧。\n\n是的，终于勒布朗突破时，不用考虑对方后面还有博古特；终于库里空切时，不用考虑有两个人追着他。一直当牵制，当诱饵，当引子，彼此的锋刃拿来吓唬人，他们也腻了吧？\n\n莫兹科夫9分钟（他在场的6分钟里骑士4次失误）；博古特0分钟，艾泽利3分钟。\n\n战个痛快吧。\n\n勒布朗今天后半段的角色，就是1980年总决赛第六场，魔术师代替天钩出场那个位置。汤普森不在，他经常是场上个子最大的，却无所不能。虽然冲锋陷阵，但他时刻注意着本方人的手感。比如JR史密斯第一节手感好，他便着意给JR叫战术。而且，他防利文斯顿那段，是骑士的妙招：利文斯顿没有三分球，所以，勒布朗可以时不时放开利文斯顿，游弋扫荡。\n\n第二节开始，多丽丝-伯克问布拉特教练，“JR史密斯射中跳投对全队有啥影响”，布拉特教练闷了会儿，说：“全队都很高兴……”\n\n但勇士也不遑多让。没有博古特后，格林的内切和分球骁勇无比，妙在他也知道自己袭篮除了抛射别无他招，所以经常径直加速找犯规——他那个速率，明显就不打算上篮了。\n\nJR史密斯远射，巴博萨妖异的单挑。利文斯顿持球伊戈达拉空切，勒布朗突破撤步投篮。\n\n第二节中，勒布朗和库里开始第一回合对决：\n\n勒布朗用火车加速震开伊戈达拉中投，然而库里持球绕掩护逼得汤普森换防后，起手三分球。勒布朗的中投一度让骑士领先6分，但库里下一秒还一个撤步三分。\n\n第二节后半段，骑士稳定了阵容，常让特里斯坦-汤普森在场：勒布朗突破，需要有个人补前场篮板、在禁区里接球袭篮。但伊戈达拉的一条龙游骑兵突破和巴博萨出出入入的反复穿刺，骑士也挡不住——当然，他们谁都挡不住彼此。战局僵持，需要一点火焰——打架、打仗和打球都是如此：你得让对方觉得“这家伙好厉害，今天他好像很无敌”。哪怕是虚的，谁犹豫了就谁输。勇士低迷了一个系列赛的巴恩斯，给了一点火焰：半场结束前补扣得分。\n\n外加罚球。\n\n下半场，依然是小球阵容对决。骑士下半场的首发就没上莫兹科夫，直接带JR史密斯玩儿。骑士再次祭出夹击，针对库里对球夹击，然后靠快速轮转针对格林。反过来进攻端，骑士不断找特里斯坦-汤普森——这是上一场战术的微调：\n\n\u003e 防守端，用准小个阵容（不上莫兹科夫）跟勇士的速度。\n\u003e 进攻端，用汤普森的前场篮板和高空作业袭勇士的篮——他是全场最后一个纯内线重步兵了。\n\n但骑士这里，赌输了。\n\n库里左翼三分球得手，然后被夹击后助攻伊戈达拉，连续两个三分球，勇士领先。这时，骑士没变阵。\n\n第四节，勒布朗全力出阵。抛射、突分、双方75平。勇士是靠着巴恩斯的一记怒扣——本届总决赛迄今最佳入球——稳住分差的。\n\n![5-3](/static/upload/201506151707112.jpg)\n\n于是又到大将出阵时间。库里中投，勇士77比75；勒布朗上篮，77平。\n\n之后，勒布朗不可思议的长距离三分球得手，骑士80比79领先。那是勒布朗本场最闪耀的瞬间。\n\n![5-4](/static/upload/201506151707245.jpg)\n\n甚至在库里和克雷-汤普森连续还击后，他还是可以后仰跳投得分，锁住。\n\n![5-5](/static/upload/2015061517073910.jpg)\n\n![5-6](/static/upload/201506151707378.jpg)\n\n但是：\n\n\u003e 在最后时刻，正常的套路，是双方都用无限换防，逼对方单打，但骑士还是针对库里用了夹击——他们太忌惮库里了，不想让他单挑。但他们忘了勇士最危险的家伙：\n\u003e 库里——格林——伊戈达拉连线得手，勇士89比84领先5分。这样的空位，你放不放都是错，只好赌，骑士赌输了。伊戈达拉再施展一条龙，勇士91比84领先。\n\n![5-7](/static/upload/201506151707312.jpg)\n\n![5-8](/static/upload/201506151707512.jpg)\n\n到此为止，大局已定。之后库里夭矫如龙的两个三分球，只是MVP的余兴节目，给勇士敲钉子而已。\n\n不能说骑士赌输了。让库里单挑？他例不虚发，把德拉维多瓦和特里斯坦给封喉了。夹击他？库里——格林——某射手（伊戈达拉或其他人）的连线，从第三场第四节开始，已经所向无敌了。\n\n双方都是脱下了铠甲对轰，以攻对攻。布拉特教练一定也明白，与勇士拼速度斗往返实是险招，但骑士只有这么多套路可用。勒布朗找到了JR史密斯，找到了香波特，找到了汤普森，亲身突阵之余指挥若定，但勇士无所谓了：他们不在意被骑士打成什么样，他们只是逼得骑士跟他们拼速度，然后就拿下了天王山。\n\n伊戈达拉打得，就像是个半场进攻弱化版的勒布朗——14分8篮板7助攻，最后时刻一个三分球一个加罚锁定比赛，虽然也被不断押上法场去罚球，居然出了个“砍伊战术”，也真笑话奇谈。但今天他第二节一条龙上篮后，范甘迪说了这么句话：\n\u003e “有了伊戈达拉，勇士好像多了一个组织后卫似的。”\n\u003e 这话他去年说过。范甘迪词真少。\n\u003e “有了迪奥，马刺好像多了一个组织后卫似的。”\n\n反过来：骑士今天17次助攻，11次来自勒布朗；投中32球，15球来自勒布朗——意味着什么，不言自明。\n\n虽然败北，这依然可能是勒布朗打过最好的一场总决赛，甚至可能是他打过最好的比赛：2012年对步行者第四战、对凯尔特人第六战，也不过如此了。40分14篮板11助攻，淋漓尽致，命中率44%也比前三场高。但如上所述，勇士不介意他发威；博古特始终不上，就是勇士对勒布朗的回答。你纵横疆埸去吧，我们只要全队联动——勒布朗今天没输给任何人，所当者破所击者服，哪怕跟库里玩接管比赛也没落下风。然而，勇士不在意。他们不在乎骑士如何打出勒布朗反插内切，如何打出弱侧特里斯坦+JR的挡切。骑士将勇士逼得下博古特，是骑士的胜利；勇士将骑士逼得放弃莫兹科夫，是勇士的胜利。\n\n\u003e “他持球许多。我们坚定于计划。他投中球也不要丧气，反正他会投中。48分钟，我们希望我们可以把他累倒。”\n\u003e 库里赛后如是说。\n\n天王神威，也只能到此。勒布朗可以独自得到40分外加助攻11次，但他到底是一个人，无法一个人打赢一场战争。上一场闪现在他面前的是伊戈达拉和利文斯顿，今天是伊戈达拉、格林和巴博萨，以及跗骨随身、不断用三分球回答他的库里。\n\n战争打的是士气。数量优势与质量优势，都是士气。\n\n双方甲兵陈列时，靠的是将帅筹谋。三千铁甲竟不能挡，那是武侠小说。\n\n但倘若进了散兵乱战，猛将就有机会，策马刺敌将于万众中，百万军中取上将首级——当然，还是士气。十万敌军，项羽砍一年都砍不完。\n\n篮球也是这样——偶尔会有科比三节62分比小牛全队还多的事儿，偶尔而已。今天第四节，勒布朗那记超远距离三分得手，骑士80比79领先时，天下真的已在他掌中。那是他独自奋战、鼓励队友、寻找战机、策划、筹谋、冲阵斩将，得出的一缕光芒。\n\n然后就被库里的百步穿杨、伊戈达拉们的乱箭给射散了。\n\n当然，幸运的是我们。MVP和前任MVP在总决赛天王山，合计得到77分？我们得追溯到乔丹大战邮差、乔丹大战巴克利、乔丹大战魔术师、魔术师大战伯德、J博士大战天钩那些岁月，才能看到类似的玩意了。双方你来我往勾心斗角，战到最后，逼得超级巨星终于出来，使劲气力筹谋，抖出压箱底招式，奋死血战，将个人的能力压榨到极限，将时代作为赌注放在命运天平上探测未来——《星球大战》、《海贼王》、《SLAM DUNK》的剧情也不过如此。\n\n这样的比赛，这样的英雄故事，就是篮球运动存在的意义。\n\n\u003cHR\u003e\n\n#### 来点调剂\n\n![](/static/upload/201506151838434.gif)\n\n![](/static/upload/2015061518420910.gif)\n\n![](/static/upload/201506151838445.gif)\n\n![](/static/upload/201506151845056.gif)\n\n![](/static/upload/201506151835545.png)\n\n![](/static/upload/2015061518410910.gif)\n","Tags":["NBA"],"CreateTime":1434359187,"EditTime":1434380279,"UpdateTime":1434359187,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[],"Hits":900}