{"Id":220,"Title":"2015总决赛第二场：勒布朗-詹姆斯打过的，最伟大的一场总决赛","Slug":"2015-05-15-2","Text":"首先，这是勒布朗-詹姆斯职业生涯最伟大的一场总决赛。胜过2013年第七场（37分的夺冠之战），胜过总决赛第一场（44分）。\n\n然后……克里夫兰骑士，队史上最伟大的一场比赛。\n\n然而，不止因为勒布朗。\n\n\u003cHR\u003e\n\n流程，比第一场还要戏剧性；场面，仿佛十年前马刺战活塞，二十一年前火箭战尼克斯。整个节奏是很东部化的——你知道，西部从来强弓骏马，东部一向鲜血黄沙。\n\n骑士开局，试图让每个人都融入进攻。香波特与德拉维多瓦轮流持球推反击，勒布朗先行去禁区占地方找篮。第一节中，JR史密斯一上场，就是跟莫兹科夫找二人转。每个人都要试试手。反过来，骑士用局部夹击+返位，锁住了库里。\n\n好在勇士有克雷-汤普森。\n\n比起第一场，骑士减少了无限换防。这意味着，他们得花许多精力和时间，抠每一个防守回合，事实是他们做得很好。虽然德拉维多瓦被克雷的背身打得不善，香波特吃克雷的挡切掩护，但骑士确实让格林和库里没辙了。\n\n比赛第二节，骑士开始用勇士之道还制勇士之身。\n\n当年马刺嫌博古特在场上，禁区里无人可涉足，于是波波维奇让他去罚球。\n\n西部半决赛，勇士嫌托尼-阿伦碍事，于是让博古特看防他，请他跳投。\n\n+ 一个人不擅长什么，就逼他做什么。\n+ 第二节，骑士不把博古特当人，强侧施压，对付勇士其他人；勒布朗甚至也不怎么管伊戈达拉，担当一个类似自由卫的角色，到处巡航。\n\n西部半决赛，勇士对付兰多夫，是用德雷蒙-格林找他的挡拆，欺负兰多夫防不出来——格林可是有小前锋的速度！\n\n可是……如果格林遇到个纯小前锋怎么办？\n\n赛前给某报纸写的：\n\n\u003e 詹姆斯-琼斯：\n\n\u003e\u003e 前全明星周末三分王，从韦德服侍到勒布朗的靠谱三分手；如今骑士队最纯粹单一的三分手（本季季后赛出手56次其中51个三分球）；在东部决赛也尝试担当勒夫的角色：摆小个阵容时站4号位，挡拆切出投定点三分。\n\n第二节，詹姆斯-琼斯当三分手，格林反而吃瘪了：总是用三分球和灵活性欺负其他大前锋，今天遇到有人用三分球和灵活性欺负他的了。\n\n再加上博古特一下去，骑士就用莫兹科夫欺压勇士的小球阵容内线，骑士上半场领先了。\n\n布拉特教练太狡猾了。\n\n但到了下半场，骑士的套路又回去了：\n+ 勒布朗一侧持球，找弱侧三分手。\n+ 勒布朗左翼面筐突破，或中投，或抛射，或找罚球。\n+ 勒布朗高位持球，递手给德拉维多瓦转圈儿找机会走。\n\n事实：勒布朗前12投7中，上半场独得20分，但此后22投4中，基本靠罚球了。他的体力有耗尽之时。\n\n但他还是在找人：助攻莫兹科夫中投，助攻JR史密斯三分球，助攻香波特三分球……\n\n以及防守。\n\n#### 骑士是怎么赢的？\n\n香波特只有一个三分球得手，是在加时取得领先。但他3个抢断，而且在比赛末尾，断了勇士追分的最后一点希望。\n\n莫兹科夫在第二节后半段简直统治比赛，博古特不在，他巨无霸一般——17分11篮板，唯一能挑剔的，就是罚球差了点。\n\n琼斯在第二节让球队占了主动。汤普森7个前场篮板，两场合计快30个篮板球了。\n\n全都是这些，每个角色球员，微小的细节，拼出来的。\n\n但今天骑士真正的英雄，是德拉维多瓦。\n\n总决赛前给某报纸写的文：\n\n\u003e 合格的挡拆启动者，能投定点三分，也能在有空间时完成急停跳投，节奏掌握颇佳，但没法单独指挥一支球队的进攻；能找到队友，懂得躲开夹击，轻易不失误，稳健；部分由于臂展的缘故（他的臂展=身高），有突破到篮下的运球能力和速率，但很难完成进攻。合格的三分射手；无私；高篮球智商。穷人版里德诺。\n\n\u003e 少年时曾挣扎于防守，但有澳大利亚人血液里的坚忍，肯投入精力，有时不免用力过度……在边线对球施压时，偶尔让人想到布鲁斯-鲍文，即：他会依靠勤奋、细节甚至小动作来弥补天分之不足，虽然实际效果还差一些；当然因为臂展的关系，在弧顶防守且没有队友支援时，会显得孤立无援。\n\n\u003e 东部决赛之后因为某些动作，成为了新闻人物，但早在两年前参加网的试训时，其实已经体现出“为了留在场上不惜一切”的拼命程度。以及：他在骑士的角色与作用，颇有些像五年前的德隆特-韦斯特。\n\n##### 今天，他所做的事：\n\n追库里的每一次走位，严丝合缝，是足以与2001年泰伦-卢防守艾弗森媲美的表现——哦对了，卢现在就在骑士呢。\n\n这不靠天赋，而靠细节。看看JR史密斯那三次二愣子失误你就知道了——对巴恩斯犯规请人家加罚，对克雷-汤普森犯规请人家打四分，最后时刻被库里骗到犯规——德拉维多瓦的细节分寸咬得非常强悍，是辛里奇式的强悍。\n\n更微妙的是，当迫于形势必须换防时，他防过了克雷-汤普森，防过了伊戈达拉，防过了德雷蒙-格林。格林背身单打他两次居然占不到便宜，要靠“投不进欺负你个子矮我刷篮板吧”的手段来得分。\n\n当然，还有最后时刻：不知如何，从人群里捡到了前场篮板，上罚球线，解决了比赛。\n\n这是专注的胜利，或者说，凡人的胜利。\n\n##### 回到勒布朗。\n\n这场比赛，他打得一点都不流丽，全然硬桥硬马，后半程投丢篮砸得叮当乱响。现场看比赛的韦德，一定觉得很陌生——的确，勒布朗在热那几年，一向是游刃有余，最多会犹豫，很少会打得如此艰涩生硬。\n\n但怎么说呢……这是旧克里夫兰骑士式的勒布朗。\n\n比赛后22投只有4中，伊戈达拉防得极好——顺便说句，伊戈达拉是勇士常规时间三分钟扭转11分的真功臣。他锁死了勒布朗，射中了三分球，乱军中助攻了巴恩斯。所以48分钟结束时，库里去和伊戈达拉拥抱时，满脸都是感激之情。\n\n加时最后时刻，勒布朗做了一个久违的动作：过中场便起步加速，开火车般直奔篮筐找擦板点——这是2005-06季，他最爱做的招式。此后，好久不见了。\n\n然后，被格林盖了。\n\n为什么说这是“骑士式的勒布朗”呢？\n\n2007年对活塞那场传奇的48分众所周知，但此前：对活塞前两场，勒布朗合计34投12中8失误；第四场19投8中，晋级的第六场11投3中。\n\n2008年对凯尔特人第七场45分天下皆知，但此前：第一场18投2中，第二场24投6中，第三场16投5中，第四场20投7中——当然，他还是把骑士带到了第七场才败北。\n\n四年前的此时，热vs小牛总决赛时写的：\n\n\u003e 我知道勒布朗打不好时是什么样的。2006年他面对活塞防守时曾经失误如云。2007年他打活塞头两场合计34投12中。2007年总决赛他被马刺封死了。2008年第一次去波士顿花园时他只有18投2中。但那些场次，你能够明确的认知：勒布朗在拼命，他只是像头困兽找不到出路而已。这样的勒布朗会在2007年第四场一扣劈翻拉希德，在2007年第五场得到传奇的48分，哪怕第六场命中率差，他还是在造罚球和找吉布森。2008年被缠了一整个系列赛后第七场他和皮尔斯大战波士顿花园。更不用提2009年他独自对抗魔术到最后。\n\n\u003e 他的手感会起伏，但除了2010年对凯尔特人第五场之外，他总是肯拼命打球的。手感不行用传球，传球不行拼防守，哪怕跌跌撞撞失误，他还是会一次又一次拼死突篮下。\n\n旧骑士式的勒布朗是怎样的？2009年东部决赛第四场，骑士114比116输给魔术1比3落后。那场的细节：\n就在比赛结束前4秒，刘易斯三分得手，魔术100比98领先。之后勒布朗像一列卡车一样冲向篮下（而且没有为上篮减速！），造皮特鲁斯犯规，罚中，加时。加时赛最后，刘易斯两次罚球得手115比111给骑士留了6秒，然后勒布朗在20秒暂停时一直在抬头看。他当时的表情就是这样：情况不大妙，但是，嗯……\n\n但是之后他投了一记近8米的三分球得到自己第44分，然后立刻扑过去对刘易斯犯规。在比赛结束前，没法中场发球了，他刚过半场就轰出一发三分球，没进。斯坦-范甘迪赛后表示心有余悸，而勒布朗就用那种不死心的眼神，死死看着篮筐。\n\n当他完全没有选择，必须一个人承担一切时，反而可以爆发出类似的火力。对活塞的48分也好，在波士顿花园的45分也好，都是这样“已经到这地步，不算计了，拼了吧”。\n\n比如今天，第四节剩3分钟时，那个将分差拉到11的扬手远射——那时候，他肯定不会考虑自己已经投丢多少了个。\n\n迈阿密的勒布朗，是个在体系里如鱼得水、可以命中率57%、可以自由选择进攻机会、游刃有余的指挥官。\n克里夫兰的勒布朗，是个必须一个人扛一切，哪怕18投2中还是得拼命上的家伙。\n\n今天出现的，是后一个。全场50分钟，投篮35发，罚球18次，39分16篮板11助攻，而且那些助攻不是队友跑出来的，是他一个个突破分球找到弱侧，无中生有造出来的。到后来，勇士也知道他要突破，提前收缩，但他还是一个接一个突破：因为他知道，一旦他能吸引对方夹击，哪怕球不中，内切的队友来得及补前场篮板。这仿佛强行攻城，而他自己就是攻城锤与云梯，让队友追随他的脊背，蚁附而上。\n\n这不是他最从容的一场总决赛，但是他迄今为止，打得最伟大、最有承当的一场总决赛。所以比赛结束的瞬间，他将压抑已久的情绪爆发出来，球砸地板，张口怒吼，一切都是顺利成章。他刚在联盟最强主场，透支全力，困兽死斗，做尽了一切，耗下了队史第一场总决赛胜利。\n\n**“他防守，他抓篮板，他适时投中球。他给了我们一切。”**\n\n呃，这是勒布朗说德拉维多瓦的。不过，用来形容他自己，应该也没问题。在客场，身边没有欧文也没有勒夫，只有德拉维多瓦、汤普森、莫兹科夫、香波特和琼斯们，唯一有点妖异劲的还是JR史密斯这样的二缺，就这样带着一支平民队伍——一如他当年带着大Z、古登、吉布森、帕夫洛维奇们似的——在常规赛67胜的西部冠军手里，硬抢出一场胜利。而且是队史第一场总决赛的胜利。\n\n在他被克里夫兰骑士选中，整整十二年后。\n\n\u003cHR\u003e\n\n#### 来点调剂\n\n![](/static/upload/201506151834134.gif)\n\n![](/static/upload/201506151833445.gif)\n\n![](/static/upload/201506151840434.gif)","Tags":["NBA"],"CreateTime":1434358085,"EditTime":1434364897,"UpdateTime":1434358085,"IsComment":true,"IsLinked":false,"AuthorId":10,"Template":"blog.html","Type":"article","Status":"publish","Format":"markdown","Comments":[],"Hits":262}