[{"Id":442,"Type":"backup","CreateTime":1433732076,"Data":"备份全站到 backup/20150608105434.zip 成功.","IsRead":false},{"Id":441,"Type":"comment","CreateTime":1433679022,"Data":"\u003cp\u003ebuy retin a同学，在文章《What a C programmer should know about memory》发表评论：Thanks for one\u0026#39;s marvelous posting! I truly enjoyed reading it, you\ncould be a great author. I will be sure to bookmark your blog and definitely will come back\ndown the road. I want to encourage continue your great work,\nhave a nice weekend!\u003c/p\u003e","IsRead":true},{"Id":439,"Type":"comment","CreateTime":1433674116,"Data":"\u003cp\u003eEdpremium.com review同学，在文章《What a C programmer should know about memory》发表评论：Cool blog! Is your theme custom made or did you download\nit from somewhere? A theme like yours with a few simple tweeks would\nreally make my blog jump out. Please let me know where you got\nyour theme. Thanks a lot\u003c/p\u003e","IsRead":true},{"Id":438,"Type":"backup","CreateTime":1433645677,"Data":"备份全站到 backup/20150607105434.zip 成功.","IsRead":true},{"Id":436,"Type":"comment","CreateTime":1433573549,"Data":"\u003cp\u003eNo Prescription同学，在文章《What a C programmer should know about memory》发表评论：Hi! I just wanted to ask if you ever have any problems\nwith hackers? My last blog (wordpress) was hacked and\nI ended up losing several weeks of hard work due to no data backup.\nDo you have any solutions to prevent hackers?\u003c/p\u003e","IsRead":true},{"Id":433,"Type":"backup","CreateTime":1433559276,"Data":"备份全站到 backup/20150606105434.zip 成功.","IsRead":true},{"Id":432,"Type":"comment","CreateTime":1433546732,"Data":"\u003cp\u003ebuy retin a online同学，在文章《What a C programmer should know about memory》发表评论：Hi there I am so excited I found your web site, I really found you by accident, while I was searching on Google for something else, Regardless I am here now and would just like\nto say thank you for a marvelous post and a all round interesting blog (I also love the theme/design), I\ndon’t have time to go through it all at the minute but I have\nbook-marked it and also added in your RSS feeds, so when I have time I will be back to\nread a great deal more, Please do keep up the fantastic jo.\u003c/p\u003e","IsRead":true}]