[{"Id":2623,"Type":"backup","CreateTime":1510799616,"Data":"备份全站到 backup/20171116103325.zip 成功.","IsRead":false},{"Id":2622,"Type":"backup","CreateTime":1510713215,"Data":"备份全站到 backup/20171115103325.zip 成功.","IsRead":false},{"Id":2619,"Type":"comment","CreateTime":1510631929,"Data":"\u003cp\u003eDavidCoila同学，在文章《Elixir入门教程\u003c中\u003e》发表评论：Some people, especially those running on busy daily schedules tend to use the pills to help maintain weight since they can not afford to follow all the diet programs. This is not advised. It is recommended that one seek advice from a professional in this field before using the pills. This can save one from many dangers associated with the misuse.\nThe diet pills should always be taken whole. Some people tend to divide the pills to serve a longer period of time. This is not advised and can lead to ineffectiveness. If it is required that one takes a complete tablet, it means that a certain amount of the ingredients are required to achieve the desired goal. It is also recommended that one does not crush the pill and dissolve it in beverages. Chemicals found in beverages have the potential of neutralizing the desired nutrients in the pill thereby leading to ineffectiveness. The best way to take the tablets is swallowing them whole with a glass of water.\nThe diet pills speed up the metabolic processes. This is the key factor that leads to the burning of all the fats in the body. This means that one passes out lots of urine, which subsequently leads to dehydration. It is imperative that the user take lots of water round the clock. This will help curb dehydration, which can lead to health problems. In addition to that, water offers the required medium for the function of the nutrients and elimination of the fats.\nWhen buying the review of diet pills, it is imperative that one gets the most recommended dose. People tend to compromise the quality and effectiveness of the tablets due to the variation in cost. The low priced pills depict poor quality, which means their effectiveness is not reliable. Some have also been found to cause health problems. The dose should also be taken as recommended. Over dose will not speed up the process but rather lead to complication. This will increase risk of side effects. If the taking of the pill is forgotten, do not take more to compensate for the lost time.\nThe diet plan enclosed with the diet pills has also to be followed. According to the requirements, the termination of the diet must be done even with no results. This means your body is irresponsive.\u003c/p\u003e","IsRead":false},{"Id":2617,"Type":"backup","CreateTime":1510626816,"Data":"备份全站到 backup/20171114103325.zip 成功.","IsRead":false}]